<?php

use Illuminate\Database\Seeder;
use App\Posts;

class PostsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        for($i = 0; $i <= 100; $i++){

            Posts::insert([
                'title'=> "জিন্দাবাজারসহ যেসব এলাকায় আজ বিদ্যুৎ থাকবে না",
                'content'=> "সিলেটে উন্নয়ন কাজের জন্য আজ শুক্রবার (৫ ফেব্রুয়ারি) সিলেট মহনগরের বেশ কয়েকটি এলাকায় সংযোগ বন্ধ রাখবে বিদ্যুৎ বিভাগ। গত সোমবার এক বিজ্ঞপ্তির মাধ্যমে বিষয়টি জানিয়েছেন বিউবো-২ এর নির্বাহী প্রকৌশলী শামছ-ই-আরেফিন।
                বিজ্ঞপ্তিতে জানানো হয়, বিক্রয় ও বিতরণ বিভাগ (বিউবো)-২ সিলেট দপ্তরের নিয়ন্ত্রণাধীন ১১ কেভি ফিডারের অধীনস্থ সিলেট নগরের বারুতখানা, জেলরোড, দিশারী হাওয়াপাড়া, লালবাজার রোড, উত্তরন আ/এ, নেহার মার্কেট, জিন্দাবাজার প্রাইমারি স্কুল ও আশপাশ এলাকায় ৫ ফেব্রুয়ারি (শুক্রবার) সকাল ৭টা থেকে দুপুর ১২ টা পর্যন্ত এ ৫ ঘণ্টা বিদ্যুৎ থাকবে না।",
                'image'=> "/assets/frontend/news_image/news_image_1612726538.jpg",
                'caption'=> "বিদ্যুৎ থাকবে না",
                'description'=> "বিজ্ঞপ্তিতে জানানো হয়, বিক্রয় ও বিতরণ বিভাগ",
                'slug'=> "random-slug-3423567",
                'tags'=> "বিক্রয়,ও,বিতরণ,বিভাগ ",
                'category_id'=> 1,
                'author_id'=> 1,
                'source'=> "Deshdorpon",
                'main_lead' => 1,
                'sub_lead' => 1,
                'status'=> 'published',
                'views' => 100,
                'created_at' =>  now(),
                'updated_at' =>  now(),

            ]);

        }
    }
}
